models/autoports/google_gemma_4_26b_a4b_it/readiness_vllm/P150x4/optimized_vllm/after_warmed/vllm_ci_serving_benchmark.log
INFO 09-08 21:14:54 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-08 21:14:54 [__init__.py:46] - tt -> vllm_tt_plugin.entrypoints:platform_plugin
INFO 09-08 21:14:54 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
2026-09-08 21:14:55.073 | DEBUG    | ttnn:<module>:45 - Initial ttnn.CONFIG:
Config{cache_path=/home/hous/.cache/ttnn,model_cache_path=/home/hous/.cache/ttnn/models,tmp_dir=/tmp/ttnn,enable_model_cache=false,enable_fast_runtime_mode=true,validate_program_args=false,throw_exception_on_fallback=true,enable_logging=false,enable_graph_report=false,enable_graph_python_stack_traces=false,enable_detailed_buffer_report=false,enable_detailed_tensor_report=false,enable_comparison_mode=false,comparison_mode_should_raise_exception=false,comparison_mode_pcc=0.9999,root_report_path=generated/ttnn/reports,report_name=std::nullopt,std::nullopt}
INFO 09-08 21:14:55 [__init__.py:253] Platform plugin tt is activated

################################################################################
#                                                                              #
#        **************************************************************        #
#                                                                              #
#                             D E P R E C A T E D                              #
#                                                                              #
#        **************************************************************        #
#                                                                              #
#          This vLLM fork (tenstorrent/vllm) is no longer maintained.          #
#         Tenstorrent support now ships as a plugin for UPSTREAM vLLM:         #
#                                                                              #
#          >>>   https://github.com/tenstorrent/vllm-tt-plugin   <<<           #
#                                                                              #
#      No further fixes, model enablement, or upstream merges land here,       #
#     and this repository will be archived. Migrate now: install upstream      #
#        vLLM plus vllm-tt-plugin, following that repository's README.         #
#                File issues and pull requests there, not here.                #
#                                                                              #
################################################################################

INFO 09-08 21:14:57 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-08 21:14:57 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x777c72f4c540>, trust_remote_code=False, seed=0, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=100, random_output_len=100, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='google/gemma-4-26B-A4B-it', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=1, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/home/hous/dev/tt-metal/models/autoports/google_gemma_4_26b_a4b_it/readiness_vllm/P150x4/optimized_vllm/after_warmed/vllm_ci_serving_result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-fcfb7c7e-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
INFO 09-08 21:15:00 [datasets.py:607] Sampling input_len from [100, 100] and output_len from [100, 100]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:02<00:00,  2.23s/it]
Successful warmup requests: 1/1
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 32/32 [00:24<00:00,  1.29it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Benchmark duration (s):                  24.79     
Total input tokens:                      3200      
Total generated tokens:                  3200      
Request throughput (req/s):              1.29      
Output token throughput (tok/s):         129.10    
Peak output token throughput (tok/s):    192.00    
Peak concurrent requests:                32.00     
Total token throughput (tok/s):          258.19    
---------------Time to First Token----------------
Mean TTFT (ms):                          3452.55   
Median TTFT (ms):                        3033.89   
P99 TTFT (ms):                           4513.01   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          215.49    
Median TPOT (ms):                        219.73    
P99 TPOT (ms):                           239.67    
---------------Inter-token Latency----------------
Mean ITL (ms):                           215.49    
Median ITL (ms):                         186.56    
P99 ITL (ms):                            785.05    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          24786.11  
Median E2EL (ms):                        24786.00  
P99 E2EL (ms):                           24787.39  
==================================================
nanobind: leaked 102 instances!
 - leaked instance 0x777c844e0ca8 of type "ttnn._ttnn.operations.experimental.IndexerScoreProgramConfig"
 - leaked instance 0x3dc35c30 of type "ttnn._ttnn.operations.unary.softsign_t"
 - leaked instance 0x3d8082d0 of type "ttnn._ttnn.operations.unary.lez_t"
 - leaked instance 0x777c845bf4c8 of type "ttnn._ttnn.tensor.Tile"
 - leaked instance 0x3d80f690 of type "ttnn._ttnn.operations.unary.log10_t"
 - leaked instance 0x777c84518808 of type "ttnn._ttnn.tensor.MemoryConfig"
 - leaked instance 0x3d44a290 of type "ttnn._ttnn.operations.unary.digamma_t"
 - leaked instance 0x3dad3e00 of type "ttnn._ttnn.operations.unary.log1p_t"
 - leaked instance 0x3b63b3b0 of type "ttnn._ttnn.operations.unary.ceil_t"
 - leaked instance 0x3df304c0 of type "ttnn._ttnn.operations.unary.hardmish_t"
 - leaked instance 0x3b637bc0 of type "ttnn._ttnn.operations.unary.exp2_t"
 - leaked instance 0x3d65da90 of type "ttnn._ttnn.operations.unary.log_t"
 - leaked instance 0x3dcbffd0 of type "ttnn._ttnn.operations.unary.cbrt_t"
 - leaked instance 0x3d4b1360 of type "ttnn._ttnn.operations.unary.identity_t"
 - leaked instance 0x3b63aa70 of type "ttnn._ttnn.operations.unary.eqz_t"
 - leaked instance 0x3d45a570 of type "ttnn._ttnn.operations.unary.cos_t"
 - leaked instance 0x3d9417a0 of type "ttnn._ttnn.operations.unary.asinh_t"
 - leaked instance 0x777c844e04c8 of type "ttnn._ttnn.tensor.CoreRangeSet"
 - leaked instance 0x777c84519ac8 of type "ttnn._ttnn.operations.sliding_window.Op2DSliceConfig"
 - leaked instance 0x3d19f530 of type "ttnn._ttnn.operations.unary.sigmoid_t"
 - ... skipped remainder
nanobind: leaked 984 types!
 - leaked type "SocketEndpoint"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.gt__t"
 - leaked type "ttnn._ttnn.operations.experimental.attn_res_gather_softmax_t"
 - leaked type "ttnn._ttnn.d2d_stream_service.D2DStreamServiceSender"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.SliceDeviceOperation"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.MatmulMultiCoreReuseMultiCastBatchedDRAMShardedProgramConfig"
 - leaked type "ttnn._ttnn.operations.binary.lt__t"
 - leaked type "ttnn._ttnn.operations.binary_backward.xlogy_bw_t"
 - leaked type "ttnn._ttnn.operations.experimental.insert_t"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.isclose_t"
 - ... skipped remainder
nanobind: leaked 4503 functions!
 - leaked function "__call__"
 - leaked function ""
 - leaked function ""
 - leaked function "__call__"
 - leaked function "__iter__"
 - leaked function ""
 - leaked function ""
 - leaked function ""
[...]
 - ... skipped remainder
nanobind: this is likely caused by a reference counting issue in the binding code.
See https://nanobind.readthedocs.io/en/latest/refleaks.html